MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA204/mcu.h
/* U1MODE */
/* Bitname _STSEL cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BRGH cannot be defined because it is used by more than one SFR */
/* Bitname _URXINV cannot be defined because it is used by more than one SFR */
/* Bitname _ABAUD cannot be defined because it is used by more than one SFR */
/* Bitname _LPBACK cannot be defined because it is used by more than one SFR */
/* Bitname _WAKE cannot be defined because it is used by more than one SFR */
/* Bitname _UEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTSMD cannot be defined because it is used by more than one SFR */
/* Bitname _IREN cannot be defined because it is used by more than one SFR */
/* Bitname _USIDL cannot be defined because it is used by more than one SFR */
/* Bitname _UARTEN cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _UEN1 cannot be defined because it is used by more than one SFR */

/* U1STA */
/* Bitname _URXDA cannot be defined because it is used by more than one SFR */
/* Bitname _OERR cannot be defined because it is used by more than one SFR */
/* Bitname _FERR cannot be defined because it is used by more than one SFR */
/* Bitname _PERR cannot be defined because it is used by more than one SFR */
/* Bitname _RIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _ADDEN cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _TRMT cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBF cannot be defined because it is used by more than one SFR */
/* Bitname _UTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBRK cannot be defined because it is used by more than one SFR */
/* Bitname _URXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL1 cannot be defined because it is used by more than one SFR */

/* U1TXREG */
/* Bitname _LAST cannot be defined because it is used by more than one SFR */

/* U1ADMD */
/* Bitname _ADMADDR cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR6 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR7 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK6 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK7 cannot be defined because it is used by more than one SFR */

/* U1SCCON */
/* Bitname _SCEN cannot be defined because it is used by more than one SFR */
/* Bitname _PTRCL cannot be defined because it is used by more than one SFR */
/* Bitname _T0PD cannot be defined because it is used by more than one SFR */
/* Bitname _CONV cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT1 cannot be defined because it is used by more than one SFR */

/* U1SCINT */
/* Bitname _GTCIE cannot be defined because it is used by more than one SFR */
/* Bitname _WTCIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPTIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXRPTIE cannot be defined because it is used by more than one SFR */
/* Bitname _PARIE cannot be defined because it is used by more than one SFR */
/* Bitname _GTCIF cannot be defined because it is used by more than one SFR */
/* Bitname _WTCIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPTIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXRPTIF cannot be defined because it is used by more than one SFR */

/* U1GTC */
/* Bitname _GTC cannot be defined because it is used by more than one SFR */
/* Bitname _GTC0 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC1 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC2 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC3 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC4 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC5 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC6 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC7 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC8 cannot be defined because it is used by more than one SFR */

/* U1WTCL */
/* Bitname _WTCL cannot be defined because it is used by more than one SFR */
/* Bitname _WTC0 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC1 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC2 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC3 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC4 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC5 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC6 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC7 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC8 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC9 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC10 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC11 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC12 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC13 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC14 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC15 cannot be defined because it is used by more than one SFR */

/* U1WTCH */
/* Bitname _WTCH cannot be defined because it is used by more than one SFR */
/* Bitname _WTC16 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC17 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC18 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC19 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC20 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC21 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC22 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC23 cannot be defined because it is used by more than one SFR */

/* U2MODE */
/* Bitname _STSEL cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BRGH cannot be defined because it is used by more than one SFR */
/* Bitname _URXINV cannot be defined because it is used by more than one SFR */
/* Bitname _ABAUD cannot be defined because it is used by more than one SFR */
/* Bitname _LPBACK cannot be defined because it is used by more than one SFR */
/* Bitname _WAKE cannot be defined because it is used by more than one SFR */
/* Bitname _UEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTSMD cannot be defined because it is used by more than one SFR */
/* Bitname _IREN cannot be defined because it is used by more than one SFR */
/* Bitname _USIDL cannot be defined because it is used by more than one SFR */
/* Bitname _UARTEN cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _UEN1 cannot be defined because it is used by more than one SFR */

/* U2STA */
/* Bitname _URXDA cannot be defined because it is used by more than one SFR */
/* Bitname _OERR cannot be defined because it is used by more than one SFR */
/* Bitname _FERR cannot be defined because it is used by more than one SFR */
/* Bitname _PERR cannot be defined because it is used by more than one SFR */
/* Bitname _RIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _ADDEN cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _TRMT cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBF cannot be defined because it is used by more than one SFR */
/* Bitname _UTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBRK cannot be defined because it is used by more than one SFR */
/* Bitname _URXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL1 cannot be defined because it is used by more than one SFR */

