MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA204/mcu.h
#define _SPI3CON1L_SPISIDL_POSITION              0x0000000D
#define _SPI3CON1L_SPISIDL_MASK                  0x00002000
#define _SPI3CON1L_SPISIDL_LENGTH                0x00000001

#define _SPI3CON1L_SPIEN_POSITION                0x0000000F
#define _SPI3CON1L_SPIEN_MASK                    0x00008000
#define _SPI3CON1L_SPIEN_LENGTH                  0x00000001

#define _SPI3CON1L_MODE_POSITION                 0x0000000A
#define _SPI3CON1L_MODE_MASK                     0x00000C00
#define _SPI3CON1L_MODE_LENGTH                   0x00000002

#define _SPI3CON1H_FRMCNT_POSITION               0x00000000
#define _SPI3CON1H_FRMCNT_MASK                   0x00000007
#define _SPI3CON1H_FRMCNT_LENGTH                 0x00000003

#define _SPI3CON1H_FRMSYPW_POSITION              0x00000003
#define _SPI3CON1H_FRMSYPW_MASK                  0x00000008
#define _SPI3CON1H_FRMSYPW_LENGTH                0x00000001

#define _SPI3CON1H_MSSEN_POSITION                0x00000004
#define _SPI3CON1H_MSSEN_MASK                    0x00000010
#define _SPI3CON1H_MSSEN_LENGTH                  0x00000001

#define _SPI3CON1H_FRMPOL_POSITION               0x00000005
#define _SPI3CON1H_FRMPOL_MASK                   0x00000020
#define _SPI3CON1H_FRMPOL_LENGTH                 0x00000001

#define _SPI3CON1H_FRMSYNC_POSITION              0x00000006
#define _SPI3CON1H_FRMSYNC_MASK                  0x00000040
#define _SPI3CON1H_FRMSYNC_LENGTH                0x00000001

#define _SPI3CON1H_FRMEN_POSITION                0x00000007
#define _SPI3CON1H_FRMEN_MASK                    0x00000080
#define _SPI3CON1H_FRMEN_LENGTH                  0x00000001

#define _SPI3CON1H_AUDMOD_POSITION               0x00000008
#define _SPI3CON1H_AUDMOD_MASK                   0x00000300
#define _SPI3CON1H_AUDMOD_LENGTH                 0x00000002

#define _SPI3CON1H_URDTEN_POSITION               0x0000000A
#define _SPI3CON1H_URDTEN_MASK                   0x00000400
#define _SPI3CON1H_URDTEN_LENGTH                 0x00000001

#define _SPI3CON1H_AUDMONO_POSITION              0x0000000B
#define _SPI3CON1H_AUDMONO_MASK                  0x00000800
#define _SPI3CON1H_AUDMONO_LENGTH                0x00000001

#define _SPI3CON1H_IGNTUR_POSITION               0x0000000C
#define _SPI3CON1H_IGNTUR_MASK                   0x00001000
#define _SPI3CON1H_IGNTUR_LENGTH                 0x00000001

#define _SPI3CON1H_IGNROV_POSITION               0x0000000D
#define _SPI3CON1H_IGNROV_MASK                   0x00002000
#define _SPI3CON1H_IGNROV_LENGTH                 0x00000001

#define _SPI3CON1H_SPISGNEXT_POSITION            0x0000000E
#define _SPI3CON1H_SPISGNEXT_MASK                0x00004000
#define _SPI3CON1H_SPISGNEXT_LENGTH              0x00000001

#define _SPI3CON1H_AUDEN_POSITION                0x0000000F
#define _SPI3CON1H_AUDEN_MASK                    0x00008000
#define _SPI3CON1H_AUDEN_LENGTH                  0x00000001

#define _SPI3CON1H_FRMCNT0_POSITION              0x00000000
#define _SPI3CON1H_FRMCNT0_MASK                  0x00000001
#define _SPI3CON1H_FRMCNT0_LENGTH                0x00000001

#define _SPI3CON1H_FRMCNT1_POSITION              0x00000001
#define _SPI3CON1H_FRMCNT1_MASK                  0x00000002
#define _SPI3CON1H_FRMCNT1_LENGTH                0x00000001

#define _SPI3CON1H_FRMCNT2_POSITION              0x00000002
#define _SPI3CON1H_FRMCNT2_MASK                  0x00000004
#define _SPI3CON1H_FRMCNT2_LENGTH                0x00000001

#define _SPI3CON1H_AUDMOD0_POSITION              0x00000008
#define _SPI3CON1H_AUDMOD0_MASK                  0x00000100
#define _SPI3CON1H_AUDMOD0_LENGTH                0x00000001

#define _SPI3CON1H_AUDMOD1_POSITION              0x00000009
#define _SPI3CON1H_AUDMOD1_MASK                  0x00000200
#define _SPI3CON1H_AUDMOD1_LENGTH                0x00000001

#define _SPI3CON2_FRMCNT_POSITION                0x00000000
#define _SPI3CON2_FRMCNT_MASK                    0x00000007
#define _SPI3CON2_FRMCNT_LENGTH                  0x00000003

#define _SPI3CON2_FRMSYPW_POSITION               0x00000003
#define _SPI3CON2_FRMSYPW_MASK                   0x00000008
#define _SPI3CON2_FRMSYPW_LENGTH                 0x00000001

#define _SPI3CON2_MSSEN_POSITION                 0x00000004
#define _SPI3CON2_MSSEN_MASK                     0x00000010
#define _SPI3CON2_MSSEN_LENGTH                   0x00000001

#define _SPI3CON2_FRMPOL_POSITION                0x00000005
#define _SPI3CON2_FRMPOL_MASK                    0x00000020
#define _SPI3CON2_FRMPOL_LENGTH                  0x00000001

#define _SPI3CON2_FRMSYNC_POSITION               0x00000006
#define _SPI3CON2_FRMSYNC_MASK                   0x00000040
#define _SPI3CON2_FRMSYNC_LENGTH                 0x00000001

#define _SPI3CON2_FRMEN_POSITION                 0x00000007
#define _SPI3CON2_FRMEN_MASK                     0x00000080
#define _SPI3CON2_FRMEN_LENGTH                   0x00000001

#define _SPI3CON2_AUDMOD_POSITION                0x00000008
#define _SPI3CON2_AUDMOD_MASK                    0x00000300
#define _SPI3CON2_AUDMOD_LENGTH                  0x00000002

#define _SPI3CON2_URDTEN_POSITION                0x0000000A
#define _SPI3CON2_URDTEN_MASK                    0x00000400
#define _SPI3CON2_URDTEN_LENGTH                  0x00000001

#define _SPI3CON2_AUDMONO_POSITION               0x0000000B
#define _SPI3CON2_AUDMONO_MASK                   0x00000800
#define _SPI3CON2_AUDMONO_LENGTH                 0x00000001

#define _SPI3CON2_IGNTUR_POSITION                0x0000000C
#define _SPI3CON2_IGNTUR_MASK                    0x00001000
#define _SPI3CON2_IGNTUR_LENGTH                  0x00000001

#define _SPI3CON2_IGNROV_POSITION                0x0000000D
#define _SPI3CON2_IGNROV_MASK                    0x00002000
#define _SPI3CON2_IGNROV_LENGTH                  0x00000001

#define _SPI3CON2_SPISGNEXT_POSITION             0x0000000E
#define _SPI3CON2_SPISGNEXT_MASK                 0x00004000
#define _SPI3CON2_SPISGNEXT_LENGTH               0x00000001

#define _SPI3CON2_AUDEN_POSITION                 0x0000000F
#define _SPI3CON2_AUDEN_MASK                     0x00008000
#define _SPI3CON2_AUDEN_LENGTH                   0x00000001

#define _SPI3CON2_FRMCNT0_POSITION               0x00000000
#define _SPI3CON2_FRMCNT0_MASK                   0x00000001
#define _SPI3CON2_FRMCNT0_LENGTH                 0x00000001

#define _SPI3CON2_FRMCNT1_POSITION               0x00000001
#define _SPI3CON2_FRMCNT1_MASK                   0x00000002
#define _SPI3CON2_FRMCNT1_LENGTH                 0x00000001

